# Функция возвращает размер числа в двоичной записи
def size(n):
    count = 0

    while (n != 0):
        count +=1
        n //= 2

    return count
# 110 0
# 11  1
# 1   2
# 0   3

def R(N):
    x = N % 3
# 5_10 = 101_2
# x = 10_2
# y = 110_2
# N = 101 * 1000 = 101'000 
# N = 101'000 + 110 = 101'110

# 12_10 = 1100_2
# 1100'100
# y = N % (2 ** 3) = 100
# N = N * (2 ** 3) + y = 1100'000 + 100 = 1100'100

    if x == 0 :
        y = N % (2 ** 3)
        N = N * (2 ** 3) + y
    else :
        y = x * 3
        N = N * (2 ** size(y)) + y

    return N

N = 0

while(R(N) < 200) :
    N += 1

print(N)