# Леонид составляет слова путем перестановки букв в слове ПРОБНИК.
# Известно, что любая последовательность должна начинаться и заканчиваться
# согласной буквой и не содержать двух подряд идущих гласных букв.
# Сколько последовательностей длиной 7 может составить Леонид?
# П-2
# Р-3
# О-0
# Б-4
# Н-5
# И-1
# К-6

def f(n):
    s = ''
    while n>0:
        s = f'{n%7:x}' + s
        n = n//7
    return s

# "23453341"
def D(s):
    count = 0
    for x in s:
        if s.count(x) != 1:
            return 0

    if s[0] != '0' and s[-1] != '0' and s[0] != '1' and s[-1] != '1':
        if '01' not in s and '10' not in s and '00' not in s and '11' not in s:
            count+=1
    return count
    

count = 0
for a in range(7**6,7**7):
    if D(f(a)):
        count+=1
print(count)


    