# Считать строку чисел, и второе число возвести в степень 2,
# третье в 3 степень, четвертое в 4 степень и т. д.
# В конце вывести новый список чисел

# int('10') # норм
# int('1 2 3') # ошибка
# int(['1', '2']) #ошибка

a=input('ЧИСЛА ').split()
for b in range(len(a)):
    a[b] = int(a[b])

# # a = ['1', '2', '3']
# # a[0] = int('1')
# # a[1] = int('2')
# # a[2] = int('3')


for x in range(1, len(a)):
    a[x] = a[x]**(x+1) 

# a = [int(x) for x in input().split()]
# for x in range(1, len(a)):
#     a[x] = a[x]**(x+1) 
print(a)